nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/dsp_examples/hello_world_usart/hifi1/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N4, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31, input_buffer: enable}
  - {pin_num: N5, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t port8_pin7_config = (/* Pin is configured as LP_FLEXCOMM18_P0 */
	                                        IOPCTL_PIO_FUNC1 |
	                                        /* Disable pull-up / pull-down function */
	                                        IOPCTL_PIO_PUPD_DI |
	                                        /* Enable pull-down function */
	                                        IOPCTL_PIO_PULLDOWN_EN |
	                                        /* Enables input buffer function */
	                                        IOPCTL_PIO_INBUF_EN |
	                                        /* Normal mode */
	                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
	                                        /* Normal drive */
	                                        IOPCTL_PIO_FULLDRIVE_DI |
	                                        /* Analog mux is disabled */
	                                        IOPCTL_PIO_ANAMUX_DI |
	                                        /* Pseudo Output Drain is disabled */
	                                        IOPCTL_PIO_PSEDRAIN_DI |
	                                        /* Input function is not inverted */
	                                        IOPCTL_PIO_INV_DI);
	    /* PORT8 PIN7 (coords: M16) is configured as LP_FLEXCOMM18_P0 */
    IOPCTL_PinMuxSet(8U, 7U, port8_pin7_config);

    const uint32_t port8_pin8_config = (/* Pin is configured as LP_FLEXCOMM18_P1 */
	                                        IOPCTL_PIO_FUNC1 |
	                                        /* Disable pull-up / pull-down function */
	                                        IOPCTL_PIO_PUPD_DI |
	                                        /* Enable pull-down function */
	                                        IOPCTL_PIO_PULLDOWN_EN |
	                                        /* Disable input buffer function */
	                                        IOPCTL_PIO_INBUF_DI |
	                                        /* Normal mode */
	                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
	                                        /* Normal drive */
	                                        IOPCTL_PIO_FULLDRIVE_DI |
	                                        /* Analog mux is disabled */
	                                        IOPCTL_PIO_ANAMUX_DI |
	                                        /* Pseudo Output Drain is disabled */
	                                        IOPCTL_PIO_PSEDRAIN_DI |
	                                        /* Input function is not inverted */
	                                        IOPCTL_PIO_INV_DI);
	    /* PORT8 PIN8 (coords: T11) is configured as LP_FLEXCOMM18_P1 */
   IOPCTL_PinMuxSet(8U, 8U, port8_pin8_config);

   const uint32_t port8_pin14_config = (/* Pin is configured as LP_FLEXCOMM19_P0 */
	                                         IOPCTL_PIO_FUNC1 |
	                                         /* Disable pull-up / pull-down function */
	                                         IOPCTL_PIO_PUPD_DI |
	                                         /* Enable pull-down function */
	                                         IOPCTL_PIO_PULLDOWN_EN |
	                                         /* Enables input buffer function */
	                                         IOPCTL_PIO_INBUF_EN |
	                                         /* Normal mode */
	                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
	                                         /* Normal drive */
	                                         IOPCTL_PIO_FULLDRIVE_DI |
	                                         /* Analog mux is disabled */
	                                         IOPCTL_PIO_ANAMUX_DI |
	                                         /* Pseudo Output Drain is disabled */
	                                         IOPCTL_PIO_PSEDRAIN_DI |
	                                         /* Input function is not inverted */
	                                         IOPCTL_PIO_INV_DI);
	    /* PORT8 PIN14 (coords: R10) is configured as LP_FLEXCOMM19_P0 */
    IOPCTL_PinMuxSet(8U, 14U, port8_pin14_config);

    const uint32_t port8_pin15_config = (/* Pin is configured as LP_FLEXCOMM19_P1 */
	                                         IOPCTL_PIO_FUNC1 |
	                                         /* Disable pull-up / pull-down function */
	                                         IOPCTL_PIO_PUPD_DI |
	                                         /* Enable pull-down function */
	                                         IOPCTL_PIO_PULLDOWN_EN |
	                                         /* Disable input buffer function */
	                                         IOPCTL_PIO_INBUF_DI |
	                                         /* Normal mode */
	                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
	                                         /* Normal drive */
	                                         IOPCTL_PIO_FULLDRIVE_DI |
	                                         /* Analog mux is disabled */
	                                         IOPCTL_PIO_ANAMUX_DI |
	                                         /* Pseudo Output Drain is disabled */
	                                         IOPCTL_PIO_PSEDRAIN_DI |
	                                         /* Input function is not inverted */
	                                         IOPCTL_PIO_INV_DI);
	    /* PORT8 PIN15 (coords: T10) is configured as LP_FLEXCOMM19_P1 */
    IOPCTL_PinMuxSet(8U, 15U, port8_pin15_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
